#### Terraform Format and Style 🖌``
 #### Terraform Initialization 🤖``
 #### Terraform Validation 🤖``
 #### Terraform Plan 📖`success`
 <details><summary>Show Plan</summary>
 ```

 data.terraform_remote_state.vpc: Reading...
data.archive_file.lambda_archive: Reading...
data.archive_file.lambda_archive: Read complete after 0s [id=88a5b0f0992f48dffb67f30df84b46ec03a3c874]
data.aws_iam_policy.aws_xray_write_only_access: Reading...
data.aws_route53_zone.domain: Reading...
data.aws_iam_policy.aws_xray_write_only_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess]
data.aws_route53_zone.domain: Read complete after 0s [id=Z0557002I9JT094NPN27]
data.terraform_remote_state.vpc: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + certificate_body          = <<-EOT
            <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIEpjCCA46gAwIBAgIUQcJsRhMU0YKLEciBEtF7JDcvkbMwDQYJKoZIhvcNAQEL
            BQAwgYsxCzAJBgNVBAYTAlVTMRkwFwYDVQQKExBDbG91ZEZsYXJlLCBJbmMuMTQw
            MgYDVQQLEytDbG91ZEZsYXJlIE9yaWdpbiBTU0wgQ2VydGlmaWNhdGUgQXV0aG9y
            aXR5MRYwFAYDVQQHEw1TYW4gRnJhbmNpc2NvMRMwEQYDVQQIEwpDYWxpZm9ybmlh
            MB4XDTI0MDMyOTE5MDYwMFoXDTI2MDMyOTE5MDYwMFowYjEZMBcGA1UEChMQQ2xv
            dWRGbGFyZSwgSW5jLjEdMBsGA1UECxMUQ2xvdWRGbGFyZSBPcmlnaW4gQ0ExJjAk
            BgNVBAMTHUNsb3VkRmxhcmUgT3JpZ2luIENlcnRpZmljYXRlMIIBIjANBgkqhkiG
            9w0BAQEFAAOCAQ8AMIIBCgKCAQEAkN4LiFPn0bMdKapTz/reD3YPsfZXtF7oh+Dx
            MdXKR5iccyVFny6cPgyJ4pLV1eBAU/UiB8ZgDWidUj29aKx/LvPenaB/RukEjFc1
            5zrnbaDTMjCmGQKVYRkSsdRCDkDjyiQAj4zwzhbEM1MpmBCam7TpYaBso6rTB6zz
            UrdBWHm4KLXLIa2PWz0OejOOyZ6Sky21j46hjwz/S50OIDEBiS5SEudDsCiqq7p5
            4YclbMYFXVKE3eyO/uFjYLkqkh/CZ1w9lvjK+xz+FFrVNuVqSW4pCb6SLysABvOr
            DJ5/1/qKWBmJWV2UN6xX+A2z0daMPy/ZOYRG8frncneEVlEkgwIDAQABo4IBKDCC
            ASQwDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsGAQUFBwMCBggrBgEFBQcD
            ATAMBgNVHRMBAf8EAjAAMB0GA1UdDgQWBBRgZwfo/8KXrKznkMYBo+Fa1lH14zAf
            BgNVHSMEGDAWgBQk6FNXXXw0QIep65TbuuEWePwppDBABggrBgEFBQcBAQQ0MDIw
            MAYIKwYBBQUHMAGGJGh0dHA6Ly9vY3NwLmNsb3VkZmxhcmUuY29tL29yaWdpbl9j
            YTApBgNVHREEIjAggh5ub3dwbGF5aW5nLXN0YWdpbmcubGhvd3NhbS5jb20wOAYD
            VR0fBDEwLzAtoCugKYYnaHR0cDovL2NybC5jbG91ZGZsYXJlLmNvbS9vcmlnaW5f
            Y2EuY3JsMA0GCSqGSIb3DQEBCwUAA4IBAQAbR1AHX08x6dx16P9+RmDDWydZlhKf
            qtghVLl+/r/aSkaFQSQuY3IBAXo2RndBti9ctHktRdpQnsPi5nVO62gpYZuG27hm
            +nujeY1VyUPNFjZ4xBzpRyPgWEtWp4WULR4eBdvhxHecFhds1RoBPbjz98mXJvaP
            2HMIGtbqUY09m6qIk14B09F9WuM53f8VFPnOjLCYkeOMAvXKL4H6/+7aRRRVnVs6
            0KThJk7EfIGGUaM7mNMncoh3uzDJ/JBiGlwUFhwk+PZnXbK/W2o3hSK2vBjoEWLD
            GXYGSS5OWwqQbiqajOM5pkzaxQTxW+iYHOCtuTwsTPCayDkc1y05oYzc
            -----END CERTIFICATE-----
            EOT
        EOT
      + certificate_chain         = <<-EOT
            <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIEADCCAuigAwIBAgIID+rOSdTGfGcwDQYJKoZIhvcNAQELBQAwgYsxCzAJBgNV
            BAYTAlVTMRkwFwYDVQQKExBDbG91ZEZsYXJlLCBJbmMuMTQwMgYDVQQLEytDbG91
            ZEZsYXJlIE9yaWdpbiBTU0wgQ2VydGlmaWNhdGUgQXV0aG9yaXR5MRYwFAYDVQQH
            Ew1TYW4gRnJhbmNpc2NvMRMwEQYDVQQIEwpDYWxpZm9ybmlhMB4XDTE5MDgyMzIx
            MDgwMFoXDTI5MDgxNTE3MDAwMFowgYsxCzAJBgNVBAYTAlVTMRkwFwYDVQQKExBD
            bG91ZEZsYXJlLCBJbmMuMTQwMgYDVQQLEytDbG91ZEZsYXJlIE9yaWdpbiBTU0wg
            Q2VydGlmaWNhdGUgQXV0aG9yaXR5MRYwFAYDVQQHEw1TYW4gRnJhbmNpc2NvMRMw
            EQYDVQQIEwpDYWxpZm9ybmlhMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKC
            AQEAwEiVZ/UoQpHmFsHvk5isBxRehukP8DG9JhFev3WZtG76WoTthvLJFRKFCHXm
            V6Z5/66Z4S09mgsUuFwvJzMnE6Ej6yIsYNCb9r9QORa8BdhrkNn6kdTly3mdnykb
            OomnwbUfLlExVgNdlP0XoRoeMwbQ4598foiHblO2B/LKuNfJzAMfS7oZe34b+vLB
            yrP/1bgCSLdc1AxQc1AC0EsQQhgcyTJNgnG4va1c7ogPlwKyhbDyZ4e59N5lbYPJ
            SmXI/cAe3jXj1FBLJZkwnoDKe0v13xeF+nF32smSH0qB7aJX2tBMW4TWtFPmzs5I
            lwrFSySWAdwYdgxw180yKU0dvwIDAQABo2YwZDAOBgNVHQ8BAf8EBAMCAQYwEgYD
            VR0TAQH/BAgwBgEB/wIBAjAdBgNVHQ4EFgQUJOhTV118NECHqeuU27rhFnj8KaQw
            HwYDVR0jBBgwFoAUJOhTV118NECHqeuU27rhFnj8KaQwDQYJKoZIhvcNAQELBQAD
            ggEBAHwOf9Ur1l0Ar5vFE6PNrZWrDfQIMyEfdgSKofCdTckbqXNTiXdgbHs+TWoQ
            wAB0pfJDAHJDXOTCWRyTeXOseeOi5Btj5CnEuw3P0oXqdqevM1/+uWp0CM35zgZ8
            VD4aITxity0djzE6Qnx3Syzz+ZkoBgTnNum7d9A66/V636x4vTeqbZFBr9erJzgz
            hhurjcoacvRNhnjtDRM0dPeiCJ50CP3wEYuvUzDHUaowOsnLCjQIkWbR7Ni6KEIk
            MOz2U0OBSif3FTkhCgZWQKOOLo1P42jHC3ssUZAtVNXrCk3fw9/E15k8NPkBazZ6
            0iykLhH1trywrKRMVw67F44IE8Y=
            -----END CERTIFICATE-----
            EOT
        EOT
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + private_key               = (sensitive value)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "Name"    = "Nowplaying certificate for staging"
          + "service" = "nowplaying"
          + "stage"   = "staging"
        }
      + tags_all                  = {
          + "Name"    = "Nowplaying certificate for staging"
          + "service" = "nowplaying"
          + "stage"   = "staging"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # aws_acm_certificate.root_domain will be created
  + resource "aws_acm_certificate" "root_domain" {
      + arn                       = (known after apply)
      + domain_name               = "nowplaying-staging.lhowsam.com"
      + domain_validation_options = [
          + {
              + domain_name           = "nowplaying-staging.lhowsam.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "nowplaying-staging.lhowsam.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_apigatewayv2_api.lambda will be created
  + resource "aws_apigatewayv2_api" "lambda" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "now-playing-gw-staging"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)

      + cors_configuration {
          + allow_headers  = [
              + "*",
            ]
          + allow_methods  = [
              + "*",
            ]
          + allow_origins  = [
              + "*",
            ]
          + expose_headers = [
              + "*",
            ]
        }
    }

  # aws_apigatewayv2_api_mapping.lambda will be created
  + resource "aws_apigatewayv2_api_mapping" "lambda" {
      + api_id      = (known after apply)
      + domain_name = "nowplaying-staging.lhowsam.com"
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # aws_apigatewayv2_domain_name.domain_name will be created
  + resource "aws_apigatewayv2_domain_name" "domain_name" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "nowplaying-staging.lhowsam.com"
      + id                               = (known after apply)
      + tags_all                         = (known after apply)

      + domain_name_configuration {
          + certificate_arn                        = (known after apply)
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # aws_apigatewayv2_integration.lambda will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.lambda_route_health will be created
  + resource "aws_apigatewayv2_route" "lambda_route_health" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + operation_name     = "health"
      + route_key          = "GET /api/health"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda_route_health_head will be created
  + resource "aws_apigatewayv2_route" "lambda_route_health_head" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + operation_name     = "head health"
      + route_key          = "HEAD /api/health"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda_route_now_playing will be created
  + resource "aws_apigatewayv2_route" "lambda_route_now_playing" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + operation_name     = "now-playing"
      + route_key          = "GET /api/now-playing"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda_route_version will be created
  + resource "aws_apigatewayv2_route" "lambda_route_version" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + operation_name     = "version"
      + route_key          = "GET /api/version"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.lambda will be created
  + resource "aws_apigatewayv2_stage" "lambda" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "staging"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 100
          + throttling_rate_limit    = 100
        }
    }

  # aws_cloudwatch_log_group.api_gw will be created
  + resource "aws_cloudwatch_log_group" "api_gw" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/api_gw/now-playing-gw-staging"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.lambda_logs will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/nowplaying-lambda-staging"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless_lambda-staging-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.aws_xray_write_only_access will be created
  + resource "aws_iam_role_policy_attachment" "aws_xray_write_only_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess"
      + role       = "serverless_lambda-staging-exec-role"
    }

  # aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "serverless_lambda-staging-exec-role"
    }

  # aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "Now playing Lambda staging"
      + filename                       = "./../lambda.zip"
      + function_name                  = "nowplaying-lambda-staging"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "D83yNSlOQ7ETC4B8MJLRDyrwwP7Qx7V5YC2bN3eAv50="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "staging"
          + "Service"     = "nowplaying"
        }
      + tags_all                       = {
          + "Environment" = "staging"
          + "Service"     = "nowplaying"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SHOULD_CALL_SPOTIFY"   = "true"
              + "SPOTIFY_CLIENT_ID"     = "c24672cc8dd943d68bd0f035a3ff4c71"
              + "SPOTIFY_CLIENT_SECRET" = "d5299391b80b4339ac627d100e62df5a"
              + "SPOTIFY_REFRESH_TOKEN" = "AQAvRBTkIl5x9Iw9y6D_QGj3b7qugvxgvWotb6szLt2y6vNvQBpO12jC6fzXuMoPOtJFytqtP0HHrHWjJXP2CTVYvBBBLgSWvyLuD2c6a_yd8NBrd7t4R7E44wMa9jbGpRY"
            }
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_permission.api_gw will be created
  + resource "aws_lambda_permission" "api_gw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "nowplaying-lambda-staging"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + base_url      = (known after apply)
  + function_name = "nowplaying-lambda-staging"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

 ```
 </details>
  *Pushed by: @luke-h1, Action: `pull_request`*